anysphere.pyright
azurite.azurite
charliermarsh.ruff
cweijan.vscode-office
davidanson.vscode-markdownlint
dracula-theme.theme-dracula
eamodio.gitlens
github.copilot
github.copilot-chat
github.github-vscode-theme
grapecity.gc-excelviewer
moshfeu.compare-folders
ms-azuretools.azure-dev
ms-azuretools.vscode-azure-github-copilot
ms-azuretools.vscode-azureappservice
ms-azuretools.vscode-azurecontainerapps
ms-azuretools.vscode-azurefunctions
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-azurestaticwebapps
ms-azuretools.vscode-azurestorage
ms-azuretools.vscode-azurevirtualmachines
ms-azuretools.vscode-cosmosdb
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-zh-hans
ms-dotnettools.vscode-dotnet-runtime
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.vscode-ai
ms-toolsai.vscode-ai-remote
ms-vscode-remote.remote-containers
ms-vscode.azure-account
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.vscode-node-azure-pack
nikolapaunovic.tkinter-snippets
oouo-diogo-perdigao.docthis
pkief.material-icon-theme
redhat.java
shd101wyy.markdown-preview-enhanced
shinotatwu-ds.file-tree-generator
tushortz.pygame-snippets
twxs.cmake
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
yzane.markdown-pdf
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
